package com.hfwas.demo;

/**
 * @Author: HFwas
 * @Date: 2020/12/9
 * @Description: java 内存划分
 * @version: 1.0
 */
public class JavaMemory {

    /*
        Java内存划分：
            1.栈：存放的都是方法中的局部变量。方法的与逆行一定要再栈当中运行
                局部变量：方法的参数，或者是方法{}内部的变量
                作用域：一旦超出作用域，理科从栈内存当中消失
            2.堆：凡是new出来的东西，都在堆当中
                堆内存里面的东西都有一个地址值：16进制
                堆内存里面的数据，都有默认值。规则：

            3.方法区：存储.class相关信息，包含方法的信息

            4.本地方法栈：与操作系统相关
            5.寄存器:与COU相关
     */














}
