package com.hf.test01;

/*
 * IP地址：
 * 	 IPV4：32位，4个整数，每一个整数是1个字节（无符号）0~255
 * 		例如：192.168.30.142
 *   IPV6：
 *   	128 位无符号数字，8个16进制值
 *   	例如：1080:0:0:0:8:800:200C:417A  
 *   
 *  特殊的IP：
 *   	127.0.0.1    本地回传IP
 *      224.0.0.0至239.255.255.255  广播IP地址
 *      ....
 * 域名：
 * 	  用人比较方便记忆和识别的单词来代表IP地址
 *  例如：www.atguigu.com
 *      www.jd.com
 *      www.taobao.com
 *      www.baidu.com
 *      ....
 *  域名--》域名解析器-->IP地址    
 *  
 *  域名：
 *    一级域名：.com商业
 *           .cn 中国
 *           .org 组织，机构，非盈利型
 *           .gov政府
 *           .edu教育
 *           ....
 * 域名需要注册
 */
public class TestIP {

}
